package hw_13_1;

public class Notes {

    /*
    Задача №1
 Необходимо создать класс hw_13_1.Employee со следующими методами:
getBaseSalary - получить базовую ставку
setBaseSalary
getName - получить имя
setName
getSalary - получить зарплату (должен быть абстрактный)

Задача №2
 Необходимо создать класс hw_13_1.Worker где метод getSalary будет возвращать базовую ставку и должен быть финальным.
 Необходимо создать класс hw_13_1.Manager в который нужно добавить следующие методы:
getNumberOfSubordinates - получить количество подчиненных
setNumberOfSubordinates
  в классе, метод getSalary будет возвращать значение по формуле - <базовая ставка> * (<количество подчиненных> / 100 * 3). Если количество подчиненных 0, то результат как у обычного рабочего.
 Необходимо создать класс hw_13_1.Director с теми же методами, что и hw_13_1.Manager, но метод getSalary должен возвращать результат по формуле - <базовая ставка> * (<количество подчиненных> / 100 * 9). Если количество подчиненных 0, то результат как у обычного рабочего.
 Коэффициенты для расчета ЗП у hw_13_1.Manager и hw_13_1.Director должны быть константами (коэффициенты из формулы расчета ЗП)
 Классы hw_13_1.Manager и hw_13_1.Director должны быть финальными


     */


}
