package hw_13_2;

public class Notes {
   /* Задача №1

    Создать класс Month с полями: имя месяца, количеством дней и количеством рабочих дней.
    Создать класс MonthUtils который бы хранил подготовленные месяцы или их массивы
    для использования (объекты класса Month).
    Класс Month сделать неизменяемым (immutable).
    Статические поля с объектами месяцев должны быть финальными
    Создать статические методы возвращающие кварталы (массивы по 3 месяца
    соответственно), полугодия и год.


    Extra:

    сделать класс Month nested внутри класса MonthUtils. Сделать конструктор у класса Month  private.



    Для следующих задач надо выполнить условия:
    Необходимо создать базовый абстрактный класс BaseEmployee как общего родителя
    Классы Employee и Manager должны быть финальными

    Задача №2

    Необходимо создать класс Employee с полями: имя, возраст, пол и ЗП в день.
    Все поля сделать приватными и для каждого поля добавить методы set и get.
    Класс должен иметь метод - getSalary(Month[] monthArray),
    метод возвращает зарплату за те месяцы которые были переданы в качестве аргумента.


    Задача №3

    Необходимо создать класс Manager с полями: имя, возраст, пол, ЗП в день и
    количество подчиненных. Все поля сделать приватными и для каждого поля
    добавить методы set и get. Класс должен иметь метод - getSalary(Month[] monthArray),
    метод возвращает зарплату за те месяцы которые были переданы в качестве аргумента.
    К рассчитанной ЗП должно прибавляться по 1% за каждого подчиненного.

*/
}
